# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 
# 2D пространстве (НЕОБЯЗАТЕЛЬНО, ПО ЖЕЛАНИЮ: найти растояние в 3D пространстве)
# Пример:
# A (3,6); B (2,1) -> 5,09
# A (7,-5); B (1,-1) -> 7,21


import math

def SystemCoor(x1, y1, x2, y2):
            return math.sqrt((x1 - x2)**2 + (y1 - y2)**2)
x1 = int(input('Введите координату x1: '))
y1 = int(input('Введите координату y1: '))
x2 = int(input('Введите координату x2: '))
y2 = int(input('Введите координату y2: '))


print(f'A {x1,y1}; B {x2,y2} -> {("%.2f" % SystemCoor(x1, y1, x2, y2))}')


def Coor3D(x1, y1, z1, x2, y2, z2):
            return (((x1 - x2)**2 + (y1 - y2)**2 + (z1 - z2)**2) ** 0.5)
x1 = int(input('Введите координату x1: '))
y1 = int(input('Введите координату y1: '))
z1 = int(input('Введите координату z1: '))
x2 = int(input('Введите координату x2: '))
y2 = int(input('Введите координату y2: '))
z2 = int(input('Введите координату z2: '))

print(f'A {x1,y1,z1}; B {x2,y2,z2} -> {("%.2f" % Coor3D(x1, y1, z1, x2, y2, z2))}')




